DataProcessors/БПАГПанАгентЦентрУправленияТест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>БПАГПанАгентЦентрУправленияТест</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автовыгрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автозагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Comment>Версия системы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогОбмена</Name>
					<Comment>Каталог, где хранятся файлы обмена с мобильными устройствами</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиАгентов</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеДня</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтовыгрузкаНоменклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтовыгрузкаКонтрагенты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбменАгенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Флаг</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Агент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БПАГАгенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Информация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВерсияОС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МодельУстройства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UDID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицензияДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаполнениеМаршрутов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>День</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаКонтрагентов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БПАГКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДня</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛогАгента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешенGPS</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешенGPSДляПриложения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОпределенияКоординат</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочностьОпределенияКоординат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкоростьВМоментОпределенияКоординат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньЗарядаБатареии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Данные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БПАГОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БПАГТорговыеТочки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Агент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БПАГАгенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Анкета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БПАГВидыАнкет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDЧисло</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/БПАГНастройкиАгентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>БПАГНастройкиАгентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БПАГАгенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БПАГПрофилиАгентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНастройки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БПАГВидыНастроекАгентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/БПАГВидыНастроекАгентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>БПАГВидыНастроекАгентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/БПАГПанАгентЦентрУправленияТест/Forms/УПФормаНастроек/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыборФайла(Элемент, ПроверятьСуществование = Истина)
	
	ДиалогВыбораФайла =	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогВыбораФайла.Заголовок						=	"Выберите каталог обмена";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	Элемент.Значение;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	=	ПроверятьСуществование;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Элемент.Значение = ДиалогВыбораФайла.Каталог + "\";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.АвтоЗаголовок = Ложь;
	
	Если Не Агент.Пустая() Тогда
		ЭтаФорма.Заголовок = "Настройки агента " + Агент;
	ИначеЕсли Не Профиль.Пустая() Тогда
		ЭтаФорма.Заголовок = "Настройки профиля """ + Профиль + """";
	Иначе
		ЭтаФорма.Заголовок = "Общие настройки по всем агентам";
	КонецЕсли;
	
	СформироватьДеревоНастроек();
	
КонецПроцедуры

Процедура СформироватьДеревоНастроек()
	
	НашОбъект = РеквизитФормыВЗначение("Объект");
   
	ТЗ = НашОбъект.ПолучитьТЗНастроекИзМакета();
	КоллекцияЭлементов = ДеревоНастроек.ПолучитьЭлементы();
	КоллекцияЭлементов.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БПАГНастройкиАгентов.Агент,
	|	БПАГНастройкиАгентов.Профиль,
	|	БПАГНастройкиАгентов.ВидНастройки КАК Настройка,
	|	БПАГНастройкиАгентов.Значение
	|ИЗ
	|	РегистрСведений.БПАГНастройкиАгентов КАК БПАГНастройкиАгентов";
	
	ТЗСуществующиеНастройки = Запрос.Выполнить().Выгрузить();
	
	текГруппа = 0;
	Для Каждого тмпСтрока Из ТЗ Цикл
		
		Если тмпСтрока.Скрыть = "1" Тогда
			Продолжить;
		КонецЕсли;
		
		Если (тмпСтрока.ТолькоОбщие = "1") И ((Агент <> Справочники.БПАГАгенты.ПустаяСсылка()) ИЛИ (Профиль <> Справочники.БПАГПрофилиАгентов.ПустаяСсылка())) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СокрЛП(тмпСтрока.Идентификатор) = "" Тогда
			СтрокаГруппы = КоллекцияЭлементов.Добавить();
			СтрокаГруппы.Настройка = тмпСтрока.ГруппаНастроек;
			СтрокаГруппы.Описание = тмпСтрока.Описание;
			СтрокаГруппы.ЭтоГруппа = Истина;
			
			текГруппа = СтрокаГруппы.ПолучитьЭлементы();
			
		Иначе
			НоваяСтрока = текГруппа.Добавить();
			НоваяСтрока.Настройка = тмпСтрока.Настройка;
			НоваяСтрока.Описание = тмпСтрока.Описание;
			НоваяСтрока.ЭтоГруппа = Ложь;
			НоваяСтрока.РежимПароля = тмпСтрока.РежимПароля;
			
			ОписаниеТипа = Новый ОписаниеТипов(тмпСтрока.Тип);
			НоваяСтрока.Тип = ОписаниеТипа;
			
			НайденныеСуществующиеНастройки = Неопределено;
			Если (Агент = Справочники.БПАГАгенты.ПустаяСсылка()) И (Профиль = Справочники.БПАГПрофилиАгентов.ПустаяСсылка()) Тогда
				//Это общие настройки
				//Читаем общие настройки
				Отбор = Новый Структура();
				Отбор.Вставить("Агент", Справочники.БПАГАгенты.ПустаяСсылка());
				Отбор.Вставить("Профиль", Справочники.БПАГПрофилиАгентов.ПустаяСсылка());
				Отбор.Вставить("Настройка", тмпСтрока.Настройка);

				НайденныеСуществующиеНастройки = ТЗСуществующиеНастройки.НайтиСтроки(Отбор);
				Если НайденныеСуществующиеНастройки.Количество() = 0 Тогда
					//Настройка еще не вносилась. Заполним значением по умолчанию.
					НаборЗаписей = РегистрыСведений.БПАГНастройкиАгентов.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Агент.Установить(Справочники.БПАГАгенты.ПустаяСсылка());
					НаборЗаписей.Отбор.Профиль.Установить(Справочники.БПАГПрофилиАгентов.ПустаяСсылка());
					НаборЗаписей.Отбор.ВидНастройки.Установить(тмпСтрока.Настройка);
					НаборЗаписей.Прочитать();
					НаборЗаписей.Очистить();
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.ВидНастройки = тмпСтрока.Настройка;
					НоваяЗапись.Значение = ОписаниеТипа.ПривестиЗначение(тмпСтрока.ЗначениеПоУмолчанию);
					НаборЗаписей.Записать();
					
					НоваяСтрока.Значение = ОписаниеТипа.ПривестиЗначение(тмпСтрока.ЗначениеПоУмолчанию);
					НоваяСтрока.Представление = НоваяСтрока.Значение;
					Если НоваяСтрока.РежимПароля = "1" Тогда
						Если СокрЛП(НоваяСтрока.Значение) <> "" Тогда
							НоваяСтрока.Пароль = НоваяСтрока.Значение;	
							НоваяСтрока.Значение = "****************";
							НоваяСтрока.Представление = НоваяСтрока.Значение;
						КонецЕсли;
					КонецЕсли;
					
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли (Агент = Справочники.БПАГАгенты.ПустаяСсылка()) Тогда
				//Это профиль
				//Читаем настройки профиля
				Отбор = Новый Структура();
				Отбор.Вставить("Агент", Справочники.БПАГАгенты.ПустаяСсылка());
				Отбор.Вставить("Профиль", Профиль);
				Отбор.Вставить("Настройка", тмпСтрока.Настройка);

				НайденныеСуществующиеНастройки = ТЗСуществующиеНастройки.НайтиСтроки(Отбор);
				Если НайденныеСуществующиеНастройки.Количество() = 0 Тогда
					
					//Читаем общие настройки
					Отбор = Новый Структура();
					Отбор.Вставить("Агент", Справочники.БПАГАгенты.ПустаяСсылка());
					Отбор.Вставить("Профиль", Справочники.БПАГПрофилиАгентов.ПустаяСсылка());
					Отбор.Вставить("Настройка", тмпСтрока.Настройка);

					НайденныеСуществующиеНастройки = ТЗСуществующиеНастройки.НайтиСтроки(Отбор);
					Если НайденныеСуществующиеНастройки.Количество() = 0 Тогда
						//Настройка еще не вносилась. Заполним значением по умолчанию.
						НаборЗаписей = РегистрыСведений.БПАГНастройкиАгентов.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.Агент.Установить(Справочники.БПАГАгенты.ПустаяСсылка());
						НаборЗаписей.Отбор.Профиль.Установить(Справочники.БПАГПрофилиАгентов.ПустаяСсылка());
						НаборЗаписей.Отбор.ВидНастройки.Установить(тмпСтрока.Настройка);
						НаборЗаписей.Прочитать();
						НаборЗаписей.Очистить();
						НоваяЗапись = НаборЗаписей.Добавить();
						НоваяЗапись.ВидНастройки = тмпСтрока.Настройка;
						НоваяЗапись.Значение = ОписаниеТипа.ПривестиЗначение(тмпСтрока.ЗначениеПоУмолчанию);
						НаборЗаписей.Записать();
						
						НоваяСтрока.Значение = ОписаниеТипа.ПривестиЗначение(тмпСтрока.ЗначениеПоУмолчанию);
						НоваяСтрока.Представление = НоваяСтрока.Значение;
						Если НоваяСтрока.РежимПароля = "1" Тогда
							Если СокрЛП(НоваяСтрока.Значение) <> "" Тогда
								НоваяСтрока.Пароль = НоваяСтрока.Значение;	
								НоваяСтрока.Значение = "****************";
								НоваяСтрока.Представление = НоваяСтрока.Значение;
							КонецЕсли;
						КонецЕсли;
						
						Продолжить;
					КонецЕсли;
					
				Иначе
					НоваяСтрока.Перекрывает = Истина;
				КонецЕсли;
				
			ИначеЕсли (Профиль = Справочники.БПАГПрофилиАгентов.ПустаяСсылка()) Тогда
				//Это агент
				//Читаем настройки агента
				Отбор = Новый Структура();
				Отбор.Вставить("Агент", Агент);
				Отбор.Вставить("Профиль", Справочники.БПАГПрофилиАгентов.ПустаяСсылка());
				Отбор.Вставить("Настройка", тмпСтрока.Настройка);
				
				НайденныеСуществующиеНастройки = ТЗСуществующиеНастройки.НайтиСтроки(Отбор);
				Если НайденныеСуществующиеНастройки.Количество() = 0 Тогда
					
					СравниватьСОбщимиНастройками = Ложь;
					//Читаем настройки профиля агента, если он есть
					Если Агент.Профиль <> Справочники.БПАГПрофилиАгентов.ПустаяСсылка() Тогда
						Отбор = Новый Структура();
						Отбор.Вставить("Агент", Справочники.БПАГАгенты.ПустаяСсылка());
						Отбор.Вставить("Профиль", Агент.Профиль);
						Отбор.Вставить("Настройка", тмпСтрока.Настройка);

						НайденныеСуществующиеНастройки = ТЗСуществующиеНастройки.НайтиСтроки(Отбор);
						Если НайденныеСуществующиеНастройки.Количество() = 0 Тогда
							СравниватьСОбщимиНастройками = Истина
						КонецЕсли;
					Иначе
						СравниватьСОбщимиНастройками = Истина;
					КонецЕсли;
					
					Если СравниватьСОбщимиНастройками Тогда
						//Читаем общие настройки
						Отбор = Новый Структура();
						Отбор.Вставить("Агент", Справочники.БПАГАгенты.ПустаяСсылка());
						Отбор.Вставить("Профиль", Справочники.БПАГПрофилиАгентов.ПустаяСсылка());
						Отбор.Вставить("Настройка", тмпСтрока.Настройка);

						НайденныеСуществующиеНастройки = ТЗСуществующиеНастройки.НайтиСтроки(Отбор);
						Если НайденныеСуществующиеНастройки.Количество() = 0 Тогда
							//Настройка еще не вносилась. Заполним значением по умолчанию.
							НаборЗаписей = РегистрыСведений.БПАГНастройкиАгентов.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.Агент.Установить(Справочники.БПАГАгенты.ПустаяСсылка());
							НаборЗаписей.Отбор.Профиль.Установить(Справочники.БПАГПрофилиАгентов.ПустаяСсылка());
							НаборЗаписей.Отбор.ВидНастройки.Установить(тмпСтрока.Настройка);
							НаборЗаписей.Прочитать();
							НаборЗаписей.Очистить();
							НоваяЗапись = НаборЗаписей.Добавить();
							НоваяЗапись.ВидНастройки = тмпСтрока.Настройка;
							НоваяЗапись.Значение = ОписаниеТипа.ПривестиЗначение(тмпСтрока.ЗначениеПоУмолчанию);
							НаборЗаписей.Записать();
							
							НоваяСтрока.Значение = ОписаниеТипа.ПривестиЗначение(тмпСтрока.ЗначениеПоУмолчанию);
							НоваяСтрока.Представление = НоваяСтрока.Значение;
							Если НоваяСтрока.РежимПароля = "1" Тогда
								Если СокрЛП(НоваяСтрока.Значение) <> "" Тогда
									НоваяСтрока.Пароль = НоваяСтрока.Значение;	
									НоваяСтрока.Значение = "****************";
									НоваяСтрока.Представление = НоваяСтрока.Значение;
								КонецЕсли;
							КонецЕсли;
							
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					
				Иначе
					НоваяСтрока.Перекрывает = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НайденныеСуществующиеНастройки <> Неопределено Тогда 
				НоваяСтрока.Значение = ОписаниеТипа.ПривестиЗначение(НайденныеСуществующиеНастройки[0].Значение);
				НоваяСтрока.Представление = НоваяСтрока.Значение;
			Иначе
				НоваяСтрока.Значение = ОписаниеТипа.ПривестиЗначение(тмпСтрока.ЗначениеПоУмолчанию);
				НоваяСтрока.Представление = НоваяСтрока.Значение;
			КонецЕсли;
			
			Если НоваяСтрока.РежимПароля = "1" Тогда
				Если СокрЛП(НоваяСтрока.Значение) <> "" Тогда
					НоваяСтрока.Пароль = НоваяСтрока.Значение;	
					НоваяСтрока.Значение = "****************";
					НоваяСтрока.Представление = НоваяСтрока.Значение;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		Если СокрЛП(тмпСтрока.Представление) <> "" Тогда
			НоваяСтрока.ВключитьВыборИзСписка = Истина;
			//НоваяСтрока.ПредставлениеМакет = СокрЛП(тмпСтрока.Представление);
			НоваяСтрока.ПредставлениеМакет = ПолучитьСписокЗначенийНастройки(СокрЛП(тмпСтрока.Представление));
            НоваяСтрока.Представление = НоваяСтрока.ПредставлениеМакет[НоваяСтрока.Значение].Представление;
		КонецЕсли;	 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	Если Параметры.Свойство("Агент") Тогда
		Агент = Параметры.Агент;
		ЭтаФорма.Заголовок = "Настройки агента """ + Агент + """";
	КонецЕсли;
	
	Если Параметры.Свойство("Профиль") Тогда
		Профиль = Параметры.Профиль;
		ЭтаФорма.Заголовок = "Настройки профиля агентов """ + Профиль + """";
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ЗаписатьТекущиеНастройки()
	
	//Скрытые служебные настройки
	СписокСлужебныхНастроек = Новый СписокЗначений;
	СписокСлужебныхНастроек.Добавить(Справочники.БПАГВидыНастроекАгентов.НайтиПоКоду("1СНеПоказыватьСтартовыйПомощник"));
	СписокСлужебныхНастроек.Добавить(Справочники.БПАГВидыНастроекАгентов.НайтиПоКоду("1СДатаЗакрытияДоступаКТестовомуФТП"));
	СписокСлужебныхНастроек.Добавить(Справочники.БПАГВидыНастроекАгентов.НайтиПоКоду("1СВидЗакладкиОбменДаннымиРасширенная"));
	СписокСлужебныхНастроек.Добавить(Справочники.БПАГВидыНастроекАгентов.НайтиПоКоду("1СЭтоПервыйЗапуск"));  
	СписокСлужебныхНастроек.Добавить(Справочники.БПАГВидыНастроекАгентов.НайтиПоКоду("internalVersionID"));  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БПАГНастройкиАгентов.Агент,
	|	БПАГНастройкиАгентов.Профиль,
	|	БПАГНастройкиАгентов.ВидНастройки КАК Настройка,
	|	БПАГНастройкиАгентов.Значение
	|ИЗ
	|	РегистрСведений.БПАГНастройкиАгентов КАК БПАГНастройкиАгентов
	|ГДЕ
	|	БПАГНастройкиАгентов.ВидНастройки В(&СписокСлужебныхНастроек)";
	
	Запрос.УстановитьПараметр("СписокСлужебныхНастроек", СписокСлужебныхНастроек);
	ТЗСлужебныеНастройки = Запрос.Выполнить().Выгрузить();
	//Скрытые служебные настройки конец
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БПАГНастройкиАгентов.Агент,
	|	БПАГНастройкиАгентов.Профиль,
	|	БПАГНастройкиАгентов.ВидНастройки КАК Настройка,
	|	БПАГНастройкиАгентов.Значение
	|ИЗ
	|	РегистрСведений.БПАГНастройкиАгентов КАК БПАГНастройкиАгентов";
	
	ТЗСуществующиеНастройки = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.БПАГНастройкиАгентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Агент.Установить(Агент);
	НаборЗаписей.Отбор.Профиль.Установить(Профиль);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	КоллекцияЭлементовДерева = ДеревоНастроек.ПолучитьЭлементы();
	
	
	Для Каждого тмпСтрока Из КоллекцияЭлементовДерева Цикл
		КоллекцияПодЭлементов = тмпСтрока.ПолучитьЭлементы();
		Для Каждого тмпПодСтрока Из КоллекцияПодЭлементов Цикл
			
			Если тмпПодСтрока.РежимПароля = "1" Тогда
				тмпПодСтрока.Значение = тмпПодСтрока.Пароль;
			КонецЕсли;
			
			НастройкаПерекрывает = Ложь;
			Если (Агент = Справочники.БПАГАгенты.ПустаяСсылка()) И (Профиль = Справочники.БПАГПрофилиАгентов.ПустаяСсылка()) Тогда
				//Это общие настройки
				НастройкаПерекрывает = Истина;
			ИначеЕсли (Агент = Справочники.БПАГАгенты.ПустаяСсылка()) Тогда
				//Это профиль
				//Читаем общие настройки
				Отбор = Новый Структура();
				Отбор.Вставить("Агент", Справочники.БПАГАгенты.ПустаяСсылка());
				Отбор.Вставить("Профиль", Справочники.БПАГПрофилиАгентов.ПустаяСсылка());
				Отбор.Вставить("Настройка", тмпПодСтрока.Настройка);

				НайденныеСуществующиеНастройки = ТЗСуществующиеНастройки.НайтиСтроки(Отбор);
				Если НайденныеСуществующиеНастройки.Количество() = 0 Тогда
					БПАГ.ИнформационноеСообщение("ВНИМАНИЕ! Отсутствует общая настройка """ + тмпПодСтрока.Настройка + """! Произведите начальное заполнение общих настроек!");
					Возврат;
				ИначеЕсли НайденныеСуществующиеНастройки[0].Значение <> тмпПодСтрока.Значение Тогда
					НастройкаПерекрывает = Истина;
				КонецЕсли;
				
			ИначеЕсли (Профиль = Справочники.БПАГПрофилиАгентов.ПустаяСсылка()) Тогда
				//Это агент
				СравниватьСОбщимиНастройками = Ложь;
				//Читаем настройки профиля агента (если он выбран).
				Если Агент.Профиль <> Справочники.БПАГПрофилиАгентов.ПустаяСсылка() Тогда
					Отбор = Новый Структура();
					Отбор.Вставить("Агент", Справочники.БПАГАгенты.ПустаяСсылка());
					Отбор.Вставить("Профиль", Агент.Профиль);
					Отбор.Вставить("Настройка", тмпПодСтрока.Настройка);

					НайденныеСуществующиеНастройки = ТЗСуществующиеНастройки.НайтиСтроки(Отбор);
					Если НайденныеСуществующиеНастройки.Количество() = 0 Тогда
						//В профиле не определена эта настройка. Сравним с общими настройками.
						СравниватьСОбщимиНастройками = Истина;
					ИначеЕсли НайденныеСуществующиеНастройки[0].Значение <> тмпПодСтрока.Значение Тогда
						НастройкаПерекрывает = Истина;
					КонецЕсли;
				Иначе
					СравниватьСОбщимиНастройками = Истина;
				КонецЕсли;
				
				Если СравниватьСОбщимиНастройками Тогда
					//Читаем общие настройки
					Отбор = Новый Структура();
					Отбор.Вставить("Агент", Справочники.БПАГАгенты.ПустаяСсылка());
					Отбор.Вставить("Профиль", Справочники.БПАГПрофилиАгентов.ПустаяСсылка());
					Отбор.Вставить("Настройка", тмпПодСтрока.Настройка);

					НайденныеСуществующиеНастройки = ТЗСуществующиеНастройки.НайтиСтроки(Отбор);
					Если НайденныеСуществующиеНастройки.Количество() = 0 Тогда
						БПАГ.ИнформационноеСообщение("ВНИМАНИЕ! Отсутствует общая настройка """ + тмпПодСтрока.Настройка + """! Произведите начальное заполнение общих настроек!");
						Возврат;
					ИначеЕсли НайденныеСуществующиеНастройки[0].Значение <> тмпПодСтрока.Значение Тогда
						НастройкаПерекрывает = Истина;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НастройкаПерекрывает Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Профиль = Профиль;
				НоваяЗапись.Агент = Агент;
				НоваяЗапись.ВидНастройки = тмпПодСтрока.Настройка;
				НоваяЗапись.Значение = тмпПодСтрока.Значение;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	//Запишем служебные настройки
	Если (Агент = Справочники.БПАГАгенты.ПустаяСсылка()) И (Профиль = Справочники.БПАГПрофилиАгентов.ПустаяСсылка()) Тогда
		Для Каждого Служебнаянастройка из ТЗСлужебныеНастройки Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Профиль = Справочники.БПАГАгенты.ПустаяСсылка();
			НоваяЗапись.Агент = Справочники.БПАГПрофилиАгентов.ПустаяСсылка();
			НоваяЗапись.ВидНастройки = Служебнаянастройка.Настройка;
			НоваяЗапись.Значение = Служебнаянастройка.Значение;
		КонецЦикла;
	КонецЕсли;			
				
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПредставлениеПриИзменении(Элемент)
	ТекЭлемент = Элемент.Родитель.ТекущиеДанные;
	
	ТекЭлемент.Перекрывает = Истина;
	
	Если СокрЛП(ТекЭлемент.Настройка) = "Каталог обмена" Тогда
		Если Прав(СокрЛП(ТекЭлемент.Представление), 1) <> "\" Тогда
			ТекЭлемент.Представление = СокрЛП(ТекЭлемент.Представление) + "\";
			ТекЭлемент.Значение = ТекЭлемент.Представление;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекЭлемент.РежимПароля = "1" Тогда
		ТекЭлемент.Пароль = ТекЭлемент.Представление;
		Если СокрЛП(ТекЭлемент.Представление) <> "" Тогда
			ТекЭлемент.Представление = "****************";
			ТекЭлемент.Значение = "****************";
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Элементы.ДеревоНастроек.ТекущиеДанные.ВключитьВыборИзСписка Тогда
		Элементы.ДеревоНастроек.ТекущиеДанные.Значение = Элементы.ДеревоНастроек.ТекущиеДанные.Представление;
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	ЗаписатьТекущиеНастройки();
	ЭтаФорма.Закрыть();
КонецПроцедуры

Функция ПолучитьСписокЗначенийНастройки(Знач ПредставлениеМакет)
	
	СписокЗначенийнастройки = Новый СписокЗначений;

	Многострочная = СтрЗаменить(ПредставлениеМакет, ";", Символы.ПС);
	
	Для i = 1 По СтрЧислоСтрок(Многострочная) Цикл
		СписокЗначенийнастройки.Добавить(i, СтрПолучитьСтроку(Многострочная, i));
	КонецЦикла;
	
	//ЭлементСписка = "";
	//НомерЭлементаСписка = 1;
	//Для Счетчик = 1 по СтрДлина(ПредставлениеМакет) Цикл
	//	ТекущийСимвол = Сред(ПредставлениеМакет, Счетчик, 1);
	//	Если ТекущийСимвол <> ";" Тогда
	//		ЭлементСписка = ЭлементСписка + ТекущийСимвол;
	//	Иначе
	//	    //Следующий элемент списка
	//		СписокЗначенийнастройки.Добавить(НомерЭлементаСписка, ЭлементСписка);
	//		НомерЭлементаСписка = НомерЭлементаСписка +1;
	//		ЭлементСписка = "";
	//	КонецЕсли;
	//	
	//КонецЦикла;	
	
	Возврат СписокЗначенийнастройки;
	
КонецФункции	

&НаКлиенте
Процедура ДеревоНастроекПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если СокрЛП(Элемент.Родитель.ТекущиеДанные.Настройка) = "Каталог обмена" Тогда
		СтандартнаяОбработка = Ложь;
		ВыборФайла(Элемент.Родитель.ТекущиеДанные);
	КонецЕсли;
	
	
	Если Элемент.Родитель.ТекущиеДанные.ВключитьВыборИзСписка Тогда
		СтандартнаяОбработка = Ложь;
		тмпСписок = Элемент.Родитель.ТекущиеДанные.ПредставлениеМакет;
		ДанныеВыбора = тмпСписок;
	КонецЕсли;
	//Если СокрЛП(Элемент.Родитель.ТекущиеДанные.Настройка) = "Отправлять картинки только по Wi-Fi" Тогда
	//	СтандартнаяОбработка = Ложь;
	//	тмпСписок = Элемент.Родитель.ТекущиеДанные.ПредставлениеМакет;
	//	//тмпСписок = ПолучитьСписокЗначенийНастройки(Элемент.Родитель.ТекущиеДанные.ПредставлениеМакет);
	//	ДанныеВыбора = тмпСписок;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПриАктивизацииСтроки(Элемент)
	
	ЭтаФорма.Элементы.ОписаниеНастройки.Заголовок = Элемент.ТекущиеДанные.Описание;
	Если Элемент.ТекущиеДанные.ВключитьВыборИзСписка Тогда
		Элементы.ДеревоНастроекПредставление.КнопкаВыбора = Истина;
		Элементы.ДеревоНастроекПредставление.РежимВыбораИзСписка = Истина;
		Попытка 
		Элементы.ДеревоНастроекПредставление.КнопкаВыпадающегоСписка = Ложь;
		Исключение
		КонецПопытки;
	Иначе
		//Элементы.ДеревоНастроекПредставление.КнопкаВыбора = Ложь;
		Элементы.ДеревоНастроекПредставление.РежимВыбораИзСписка = Ложь;
		Попытка 
		Элементы.ДеревоНастроекПредставление.КнопкаВыпадающегоСписка = Ложь;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Элементы.ДеревоНастроек.ТекущиеДанные.ВключитьВыборИзСписка Тогда
		СтандартнаяОбработка = Ложь;
		Элементы.ДеревоНастроек.ТекущиеДанные.Значение = ВыбранноеЗначение - 1;
		Элементы.ДеревоНастроек.ТекущиеДанные.Представление = Элементы.ДеревоНастроек.ТекущиеДанные.ПредставлениеМакет[ВыбранноеЗначение - 1];
		Элемент.Заголовок = ?(Элемент.Заголовок = "Прeдставление", "Представлениe", "Прeдставление");
	КонецЕсли;
	
	//Если СокрЛП(Элементы.ДеревоНастроек.ТекущиеДанные.Настройка) = "Отправлять картинки только по Wi-Fi" Тогда
	//	СтандартнаяОбработка = Ложь;
	//	Элементы.ДеревоНастроек.ТекущиеДанные.Значение = ВыбранноеЗначение;
	//	Если ВыбранноеЗначение = 1 Тогда
	//		Элементы.ДеревоНастроек.ТекущиеДанные.Представление = "1";
	//	ИначеЕсли ВыбранноеЗначение = 2  Тогда
	//		Элементы.ДеревоНастроек.ТекущиеДанные.Представление = "2";
	//	КонецЕсли;
	//	Элемент.Заголовок = ?(Элемент.Заголовок = "Прeдставление", "Представлениe", "Прeдставление");
	//КонецЕсли;
	
КонецПроцедуры
